Revit 2026 API

# ViewViewType Property

---

The type of the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewType ViewType { get; }
```
```vb
Public ReadOnly Property ViewType As ViewType
	Get
```
```cpp
public:
property ViewType ViewType {
	ViewType get ();
}
```
```fsharp
member ViewType : ViewType with get
```

#### Property Value

ViewType

#### Reference

View Class

Autodesk.Revit.DB Namespace